guoganghe/GD32VW55x/MSDK/FatFS/port/fatfs.c
/*!
    \file    fatfs.c
    \brief   fatfs init and config file

    \version 2024-05-30, V1.0.0, firmware for GD32VW55x
*/

/*
    Copyright (c) 2024, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include <stdlib.h>
#include <stdio.h>
#include "fatfs.h"
#include "ffconf.h"
#include "diskio.h"
#include "wrapper_os.h"
#include "gd32vw55x.h"
#include "dbg_print.h"
#include "raw_flash_api.h"
#include "wear_levelling_flash.h"
#include "config_gdm32.h"
#include "qspi_flash_api.h"

#if defined CONFIG_FATFS_SUPPORT

#define USE_WL
#define MAX_FILE_PATH 128
#define MAX_FILE_STATE 4     /* max file state level, eg:a/b/c/d.txt */
#define FATFS_OTHER_ERROR -1

#ifdef USE_QSPI_FLASH
#define FATFS_FLASH_START_ADDR  0
#else
// default fatfs start flash addr is RE_IMG_1_OFFSET
#define FATFS_FLASH_START_ADDR  RE_IMG_1_OFFSET
#endif

#define FATFS_FLASH_TOTAL_SIZE  FATFS_FULL_MEM_SIZE

static FATFS *fs = NULL;     /* Filesystem object */
#ifdef USE_QSPI_FLASH
static os_mutex_t fs_mutex = NULL;
#endif

static void fresult_analyse(int8_t res);

#ifdef USE_WL
#include "wear_levelling_flash.c"
#endif

/*!
    \brief      fatfs: create a fatfs volume and mount a logical drive
    \param[in]  none
    \param[out] none
    \retval     true: success
*/
bool fatfs_mk_mount(const MKFS_PARM* opt)
{
    int res = FR_OK;
    BYTE *work = NULL;

#ifdef USE_QSPI_FLASH
    qspi_flash_api_init();
    sys_mutex_init(&fs_mutex);
#endif

#ifdef USE_WL
    sys_memset(&wl_config_global, 0, sizeof(wl_config_global));
    wl_config_global.cfg.start_addr = FATFS_FLASH_START_ADDR;
    wl_config_global.cfg.full_mem_size = FATFS_FULL_MEM_SIZE;
    wl_config_global.cfg.page_size = FATFS_SECTOR_SIZE;
    wl_config_global.cfg.sector_size = FATFS_SECTOR_SIZE;
    wl_config_global.cfg.wr_size = 0x00000008; //bits
    wl_config_global.cfg.version = 0x00000001;
    wl_config_global.cfg.temp_buff_size = FATFS_SECTOR_SIZE;

    if (wl_flash_config(&wl_config_global)) {
#ifdef USE_QSPI_FLASH
        sys_mutex_free(&fs_mutex);
#endif
        return false;
    }
#endif

    fs = (FATFS *)sys_malloc(sizeof(FATFS));
    if (fs == NULL) {
#ifdef USE_QSPI_FLASH
        sys_mutex_free(&fs_mutex);
#endif
        return false;
    }

    res = f_mount(fs, "0", 1);  /*check if has made an volum in flash before*/
    if (res == FR_OK) {
        app_print("FATFS: mount succeed\r\n");
        return true;
    }

    work = (BYTE *)sys_malloc(FF_MAX_SS);
    if (work == NULL) {
        sys_mfree(fs);
#ifdef USE_QSPI_FLASH
        sys_mutex_free(&fs_mutex);
#endif
        return false;
    }

    res = f_mkfs("0", opt, work, FF_MAX_SS);
    if (res != FR_OK) {
        app_print("FATFS: mkfs failed\r\n");
        fresult_analyse(res);
        sys_mfree(fs);
        sys_mfree(work);
#ifdef USE_QSPI_FLASH
        sys_mutex_free(&fs_mutex);
#endif
        return false;
    }
    app_print("FATFS: mkfs succeed\r\n");

    res = f_mount(fs, "0", 1);
    if (res == FR_OK) {
        sys_mfree(work);
        app_print("FATFS: mount succeed\r\n");
        return true;
    }
    sys_mfree(fs); /* if mount succeed, do not free fs */
#ifdef USE_QSPI_FLASH
    sys_mutex_free(&fs_mutex);
#endif
    return false;
}

/*!
    \brief      get file size from a existed file and print it
    \param[in]  path:pointer to file path
    \param[out] none
    \retval     len: file size
*/
uint32_t file_size(char *path)
{
    int res = FR_OK;
    FILINFO fno;
    FIL *fil = NULL;
    uint32_t size_len = 0;

    res = f_stat(path, &fno);
    if (res != FR_OK)
        return 0;

    fil = (FIL *)sys_malloc(sizeof(FIL));
    if (NULL == fil) {
        app_print("FATFS_ERROR: file_size, malloc fil failed\r\n");
        return 0;
    }

    res = f_open(fil, path, FA_READ);
    if (res != FR_OK)
        goto Exit2;

    size_len = f_size(fil);
    if (size_len == 0 ) {
        app_print("FATFS_ERROR: file is empty\r\n");
        res = f_close(fil);
        goto Exit2;
    }

    res = f_close(fil);
    if (res != FR_OK) {
        app_print("FATFS_ERROR: close file err\r\n");
        fresult_analyse(res);
    }

Exit2:
    sys_mfree(fil);
    return size_len;
}


/*!
    \brief      delete an dir and all files under it
    \param[in]  path:pointer to dir/file path
    \param[out] none
    \retval     FRESULT: fatfs operation results
*/
int delete_files(char* path, char* path_temp)
{
    int res = FR_OK;
    DIR dir;
    UINT i, j;
    static FILINFO fno;

    res = f_opendir(&dir, path);
    if (res != FR_OK) {
        return f_unlink(path);
    }

    i = strlen(path);
    for (;;) {
        res = f_readdir(&dir, &fno);
        if (res != FR_OK || fno.fname[0] == 0) {
            break;
        }

