guoganghe/GD32VW55x/MSDK/FatFS/port/fatfs.c
        if (fno.fattrib & AM_DIR) {
            snprintf(&path[i], (strlen(fno.fname) + 2), "/%s", fno.fname);
            res = fatfs_delete(path);
            if (res != FR_OK)
                break;
            path[i] = 0;
        } else {
            snprintf(path_temp, (i + strlen(fno.fname) + 2), "%s/%s", path, fno.fname);
            res = f_unlink(path_temp);
        }
    }

    f_closedir(&dir);
    res = f_unlink(path);
    if (res != FR_OK) {
        app_print("FATFS_ERROR: delete path %s failed\r\n", path);
    }
    return res;
}

/*!
    \brief      scan an dir and print all files or dir path under it
    \param[in]  path:pointer to dir path
    \param[out] none
    \retval     FRESULT: fatfs operation results
*/
static int scan_dir(char* path)
{
    int res = FR_OK;
    DIR dir;
    UINT i;
    static FILINFO fno;

    res = f_opendir(&dir, path);
    if (res != FR_OK)
        return res;

    for (;;) {
        res = f_readdir(&dir, &fno);
        if (res != FR_OK || fno.fname[0] == 0)
            break;

        if (fno.fattrib & AM_DIR) {
            app_print("DIR: %s/%s\r\n", path, fno.fname);
            i = strlen(path);
            snprintf(&path[i], (strlen(fno.fname) + 2), "/%s", fno.fname);
            res = scan_dir(path);
            if (res != FR_OK)
                break;
            path[i] = 0;
        } else {
            app_print("FILE: %s/%s %dBytes\r\n", path, fno.fname, fno.fsize);
        }
    }
    res = f_closedir(&dir);
    return res;
}

/*!
    \brief      devided a file/dir path by '/' or '\'
    \param[in]  buf:pointer to dir/file path
    \param[out] argv:pointer to store each stage of path
    \retval     stage of path
*/
static int parse_path(char *buf, char **argv)
{
    int argc = 0;

    if (*buf == '/' || *buf == '\\') {
        buf++;        /* remove first '/' or '\\' */
    }

    while(*buf != '\0') {
        argv[argc] = buf;
        argc++;
        buf++;

        while(((*buf != '/') && (*buf != '\\')) && (*buf != '\0'))
            buf++;

        while(*buf == '/' || *buf == '\\') {
            *buf = '\0';
            buf++;
        }
    }
    return argc;
}

/*!
    \brief      analyse return value of fatfs operation any print it's reason
    \param[in]  res: FRESULT
    \param[out] none
    \retval     none
*/
static void fresult_analyse(int8_t res)
{
    switch (res) {
    case FR_OK:
        // app_print("Succeeded\r\n");
        break;
    case FR_DISK_ERR:
        app_print("FATFS_ERROR: A hard error occurred in the low level disk I/O layer\r\n");
        break;
    case FR_INT_ERR:
        app_print("FATFS_ERROR: Assertion failed\r\n");
        break;
    case FR_NOT_READY:
        app_print("FATFS_ERROR: The physical drive cannot work\r\n");
        break;
    case FR_NO_FILE:
    case FR_NO_PATH:
        app_print("FATFS_ERROR: Could not find the file or path\r\n");
        break;
    case FR_INVALID_NAME:
        app_print("FATFS_ERROR: The path name format is invalid\r\n");
        break;
    case FR_DENIED:
        app_print("FATFS_ERROR: Access denied due to prohibited access or directory full\r\n");
        break;
    case FR_EXIST:
        app_print("FATFS_ERROR: Access denied due to prohibited access\r\n");
        break;
    case FR_INVALID_OBJECT:
        app_print("FATFS_ERROR: The file/directory object is invalid\r\n");
        break;
    case FR_WRITE_PROTECTED:
        app_print("FATFS_ERROR: The physical drive is write protected\r\n");
        break;
    case FR_INVALID_DRIVE:
        app_print("FATFS_ERROR: The logical drive number is invalid\r\n");
        break;
    case FR_NOT_ENABLED:
        app_print("FATFS_ERROR: The volume has no work area \r\n");
        break;
    case FR_NO_FILESYSTEM:
        app_print("FATFS_ERROR: There is no valid FAT volume\r\n");
        break;
    case FR_MKFS_ABORTED:
        app_print("FATFS_ERROR: The f_mkfs() aborted due to any problem\r\n");
        break;
    case FR_TIMEOUT:
        app_print("FATFS_ERROR: Could not get a grant to access the volume within defined period\r\n");
        break;
    case FR_LOCKED:
        app_print("FATFS_ERROR: The operation is rejected according to the file sharing policy\r\n");
        break;
    case FR_NOT_ENOUGH_CORE:
        app_print("FATFS_ERROR: LFN working buffer could not be allocated\r\n");
        break;
    case FR_TOO_MANY_OPEN_FILES:
        app_print("FATFS_ERROR: Number of open files > FF_FS_LOCK\r\n");
        break;
    case FR_INVALID_PARAMETER:
        app_print("FATFS_ERROR: Given parameter is invalid\r\n");
        break;
    case FATFS_OTHER_ERROR:
        app_print("FATFS_ERROR: Another error occured\r\n");
        break;
    default:
        app_print("FATFS_ERROR: Unknown error occured!\r\n");
        break;
    }
}

/*!
    \brief      create a file by path
    \param[in]  path:pointer to file path
    \param[out] none
    \retval     FRESULT: fatfs operation results
*/
static int file_create(char *path)
{
    FIL *fil = NULL;
    int res = FR_OK;

    fil = (FIL *)sys_malloc(sizeof(FIL));
    if (NULL == fil) {
        app_print("FATFS_ERROR: file_create, malloc fil failed\r\n");
        return FATFS_OTHER_ERROR;
    }

    res = f_open(fil, path, FA_CREATE_NEW);
    if (res == FR_OK) {
        res = f_close(fil);
    }

    sys_mfree(fil);
    return res;
}

/*!
    \brief      create a dir/file by any stage path
    \param[in]  path:pointer to dir/file path, the maximum depth of path is 4
    \param[out] none
    \retval     FRESULT: fatfs operation results
*/
int fatfs_create(char *path)
{
    int res = FR_OK;
    char *argv_temp[MAX_FILE_STATE];
    int argc_temp = 0;
    int category = 0;
    int i = 0;
    int pos = 0;
    char path_temp[MAX_FILE_PATH + 2] = {0};  /* +2: 1 for "\" or "/" in the start of path; 1 for end "\0" */

    if (path[strlen(path) - 1] == '\\' || path[strlen(path) - 1] == '/') {
        category = 0;                /* it's a dir */
    } else {
        category = 1;                /* it's a file */
    }

    argc_temp = parse_path(path, argv_temp);
    if ( argc_temp > 4 || argc_temp == 0) {
        app_print("FATFS_ERROR: file path stage should <=4\r\n");
        return FATFS_OTHER_ERROR;
    }

    for (i = 0; i < (argc_temp - 1); i++ ) {     /* create path */
        if ((pos + strlen(argv_temp[i])) > MAX_FILE_PATH) {
            app_print("FATFS_ERROR: file path: %s/%s length should less than %d\r\n", path_temp, argv_temp[i], MAX_FILE_PATH);
            return FATFS_OTHER_ERROR;
        }

        if (i > 0) {
            path_temp[pos++] = '/';
        }
        strcpy(&path_temp[pos], argv_temp[i]);
        pos += strlen(argv_temp[i]);

        res = f_mkdir(path_temp);
        if (res != FR_EXIST && res != FR_OK) {
            return res;
        }
    }

    if ((pos + strlen(argv_temp[argc_temp - 1])) > MAX_FILE_PATH) {
        app_print("FATFS_ERROR: file path: %s/%s too long, should less than %d\r\n", path_temp, argv_temp[i], MAX_FILE_PATH);
        return FATFS_OTHER_ERROR;
    }

    if (argc_temp > 1) {
        path_temp[pos++] = '/';
    }
    strcpy(&path_temp[pos], argv_temp[argc_temp - 1]);

    if (category) {
        res = file_create(path_temp);
    } else {
        res = f_mkdir(path_temp);
    }

    return res;
}

/*!
    \brief      write data to a existed file by append to the end
    \param[in]  path:pointer to file path
    \param[in]  data:pointer to data need to be written
    \param[out] none
    \retval     FRESULT: fatfs operation results
*/
int fatfs_append(char *path, uint8_t *data, int len)
{
    int res = FR_OK;
    FIL *fil;
    FILINFO fno;
    uint32_t byte_written = 0;

