guoganghe/GD32VW55x/MSDK/FatFS/port/fatfs.c
    res = f_stat(path, &fno);
    if (res != FR_OK)
        return res;

    fil = (FIL *)sys_malloc(sizeof(FIL));
    if (fil == NULL) {
        app_print("FATFS_ERROR: fatfs_file_append, malloc fil failed\r\n");
        return FATFS_OTHER_ERROR;
    }

    res = f_open(fil, path, FA_WRITE | FA_OPEN_APPEND);
    if (res == FR_OK) {
        res = f_write(fil, data, len, (UINT *)&byte_written);
        if (res != FR_OK) {
            fresult_analyse(res);
        }
        res = f_close(fil);
    }

    sys_mfree(fil);
    return res;
}

/*!
    \brief      read data from a existed file and print it
    \param[in]  path:pointer to file path
    \param[in]  len: length to read
    \param[out] none
    \retval     len: length read
*/
uint32_t fatfs_read(char *path, uint8_t *buff, uint32_t len)
{
    int res = FR_OK;
    FILINFO fno;
    FIL *fil = NULL;
    uint32_t read_len = 0;

    res = f_stat(path, &fno);
    if (res != FR_OK){
        fresult_analyse(res);
        return 0;
    }

    fil = (FIL *)sys_malloc(sizeof(FIL));
    if (NULL == fil) {
        app_print("FATFS_ERROR: fatfs_file_read, malloc fil failed\r\n");
        return 0;
    }

    res = f_open(fil, path, FA_READ);
    if (res != FR_OK) {
        fresult_analyse(res);
        sys_mfree(fil);
        return 0;
    }

    read_len = ((f_size(fil) >= len) && (len != 0)) ? len : f_size(fil);
    if (read_len == 0) {
        app_print("FATFS_ERROR: file is empty\r\n");
        goto Exit2;
    }

    if (NULL == buff) {
        app_print("FATFS_ERROR: fatfs_file_read, read buff is NULL\r\n");
        goto Exit2;
    }

    res = f_read(fil, buff, read_len, (UINT *)&read_len);
    if (res != FR_OK) {
        fresult_analyse(res);
        goto Exit2;
    }

Exit2:
    res  = f_close(fil);
    if (res != FR_OK)
        fresult_analyse(res);

    if (fil)
        sys_mfree(fil);

    return read_len;
}

/*!
    \brief      delete a whole dir or a file
    \param[in]  path:pointer to file path
    \param[out] none
    \retval     FRESULT: fatfs operation results
*/
int fatfs_delete(const char *path)
{
    int res = FR_OK;
    FILINFO fno;
    char *path_buffer = NULL, *path_temp = NULL;

    res = f_stat(path, &fno);
    if (res == FR_OK) {
        path_buffer = (char *)sys_malloc((MAX_FILE_PATH + 2) * 2);
        if (path_buffer == NULL) {
            app_print("FATFS_ERROR: fatfs_delete, malloc path_buffer failed\r\n");
            return FATFS_OTHER_ERROR;
        }
        path_temp = path_buffer + MAX_FILE_PATH + 2;
        strncpy((char *)path_buffer, path, MAX_FILE_PATH + 2);
        res = delete_files(path_buffer, path_temp);
        sys_mfree(path_buffer);
    }
    return res;
}

/*!
    \brief      show all file/dir under path
    \param[in]  path:pointer to file path
    \param[in]  root_path:1 for show all files and dir, 0 for show files and dir under input path
    \param[out] none
    \retval     FRESULT: fatfs operation results
*/
int fatfs_show(char *path, uint8_t root_path)
{
    int res = FR_OK;
    char path_buffer[MAX_FILE_PATH + 2] = {0};

    if (root_path) {
        strncpy((char *)path_buffer, "/", MAX_FILE_PATH);
    } else {
        strncpy((char *)path_buffer, path, MAX_FILE_PATH);
    }
    res = scan_dir((char *)path_buffer);
    return res;
}

/*!
    \brief      rename file/dir name
    \param[in]  path: pointer to file path
    \param[in]  new_path: new file path
    \param[out] none
    \retval     FRESULT: fatfs operation results
*/
int fatfs_rename(char *path, char *new_path)
{
    return f_rename(path, new_path);
}

/*!
    \brief      handler to fatfs cmd input
    \param[in]  argc: number of parameters
    \param[in]  argv: the pointer to the array that holds the parameters
    \param[out] none
    \retval     0 for succeed, 1 for failed
*/
uint32_t cmd_fatfs_exec(int argc, char **argv)
{
    int res = FR_OK;
    uint32_t len = 0;

    if (strcmp(argv[1], "create") == 0) {
        if (argc == 3) {
            res = fatfs_create(argv[2]);
            fresult_analyse(res);
            return 0;
        }
    } else if (strcmp(argv[1], "append") == 0) {
        if (argc == 4) {
            res = fatfs_append(argv[2], (uint8_t *)argv[3], strlen(argv[3]));
            fresult_analyse(res);
            return 0;
        }
    } else if (strcmp(argv[1], "read") == 0) {
        uint8_t *buff = NULL;
        uint32_t read_len = 0;
        len = 0;
        if (argc == 4) {
            len = (uint32_t)atoi(argv[3]);
        } else if (argc == 3) {
            len = file_size(argv[2]);
        }
        if (len == 0)
        {
            return 0;
        }
        buff = (uint8_t *)sys_malloc(len);
        if (buff == NULL) {
            app_print("malloc buff failed\r\n");
            return 0;
        }
        read_len = fatfs_read(argv[2], buff, len);
        if (read_len) {
            app_print("FATFS: read %dBytes, conntent:", len, (char *)buff);
            for (int i = 0; i < read_len; i++) {
                app_print("0x%02x ", buff[i]);
                if ((i + 1) % 16 == 0)
                    app_print("\r\n");
            }
            app_print("\r\n");
        }
        sys_mfree(buff);
        return 0;
    } else if (strcmp(argv[1], "delete") == 0) {
        if (argc == 3) {
            res = fatfs_delete(argv[2]);
            fresult_analyse(res);
            return 0;
        }
    } else if (strcmp(argv[1], "show") == 0) {
        if (argc == 2) {
            res = fatfs_show(NULL, 1);
            fresult_analyse(res);
            return 0;
        } else if (argc == 3) {
            res = fatfs_show(argv[2], 0);
            fresult_analyse(res);
            return 0;
        }
    } else if (strcmp(argv[1], "rename") == 0) {
        if (argc == 4) {
            res = fatfs_rename(argv[2], argv[3]);
            fresult_analyse(res);
            return 0;
        }
    }
    return 1;
}

# if 0
/*!
    \brief      write data to flash after erasing the sector
    \param[in]  address: flash offset address
    \param[in]  pdata: pointer to data to be written
    \param[in]  size: length of data write to flash
    \param[out] none
    \retval     result: 0 for success, -1 for fail
*/
static int fs_normal_flash_write(uint32_t address, const uint8_t* pdata, uint16_t size)
{
    int result = 0;
    uint32_t sector_start_address = 0;
    uint16_t sector_offset = 0;
    uint16_t sector_remain = 0;
    uint32_t i;
    uint8_t *temp_buffer;
    uint8_t *temp_data;

    temp_buffer = (uint8_t *)sys_malloc(FLASH_SIP_PAGE_SIZE);
    if (temp_buffer == NULL) {
        app_print("fatfs:fs_normal_flash_write, malloc temp buffer failed\r\n");
        return -1;
    }

    temp_data = (uint8_t *)sys_malloc(size);
    if (temp_data == NULL) {
        app_print("fatfs:fs_normal_flash_write, malloc temp_data failed\r\n");
        return -1;
    }
    sys_memcpy(temp_data, pdata, size);

    sector_start_address = address & (~(FLASH_SIP_PAGE_SIZE - 1));     /* sector start address */
    sector_offset = address & (FLASH_SIP_PAGE_SIZE - 1);             /* sector inner offset */
    sector_remain = FLASH_SIP_PAGE_SIZE - sector_offset;             /* sector remain space*/

    if (size <= sector_remain) {
        sector_remain = size;
    }

    while(1) {
        /* read whole sector */
        result = raw_flash_read(sector_start_address, temp_buffer, FLASH_SIP_PAGE_SIZE);
        if (result)
            break;

        for (i = 0; i < sector_remain; i++) {                     /* check if sector has been written before */
            if (temp_buffer[sector_offset + i] != 0xFF)
                break;
        }

        if (i < sector_remain) {
            /* erase sector */
            result = raw_flash_write(sector_start_address, FLASH_SIP_PAGE_SIZE);
            if (result)
                break;

            sys_memcpy((temp_buffer + sector_offset), temp_data, sector_remain);

            result = raw_flash_write(sector_start_address, temp_buffer, FLASH_SIP_PAGE_SIZE);
            if (result)
                break;
        } else {
            result = raw_flash_write(address, temp_data, sector_remain);
            if (result)
                break;
        }

