guoganghe/GD32VW55x/MSDK/FatFS/port/fatfs.c
        if (size == sector_remain)
            break;

        sector_start_address += FLASH_SIP_PAGE_SIZE;
        sector_offset = 0;
        temp_data += sector_remain;
        address += sector_remain;
        size -= sector_remain;

        if (size > FLASH_SIP_PAGE_SIZE) {
            sector_remain = FLASH_SIP_PAGE_SIZE;
        } else {
            sector_remain = size;
        }
    }

    sys_mfree(temp_buffer);
    sys_mfree(temp_data);
    result = raw_flash_write(address, FLASH_SIP_PAGE_SIZE);
    if (result)
        return result;

    result = raw_flash_write(address, pdata, FLASH_SIP_PAGE_SIZE);
    return result;
}
#endif

/*!
    \brief      write data to flash
    \param[in]  sector:	Start sector in LBA
    \param[in]  buff: Data buffer to store write data
    \param[in]  count: Number of sectors to write
    \retval     result: 0 for success, -1 for fail
*/
int fs_flash_write(LBA_t sector, const BYTE *buff, UINT count)
{
#ifdef USE_WL
    if ((sector * FATFS_SECTOR_SIZE) > wl_config_global.flash_size) {
        app_print("FATFS_ERROR: write out of range\r\n");
        return RES_ERROR;
    }

    if (wl_flash_erase_range(&wl_config_global, (sector * FATFS_SECTOR_SIZE), (count * FATFS_SECTOR_SIZE)))
        return RES_ERROR;

    if (wl_flash_write(&wl_config_global, (sector * FATFS_SECTOR_SIZE), buff, (count * FATFS_SECTOR_SIZE)))
        return RES_ERROR;
#else
    if ((sector * FATFS_SECTOR_SIZE) > FATFS_FLASH_TOTAL_SIZE) {
        app_print("FATFS_ERROR: write out of range\r\n");
        return RES_ERROR;
    }
#ifdef USE_QSPI_FLASH
    if (sys_mutex_try_get(&fs_mutex, 60000) != OS_OK) {
        app_print("FATFS_ERROR: write can't get mutex in one minute\r\n");
        return RES_ERROR;
    }

    if (qspi_flash_erase((sector * FATFS_SECTOR_SIZE), (count * FATFS_SECTOR_SIZE))) {
        sys_mutex_put(&fs_mutex);
        return RES_ERROR;
    }

    if (qspi_flash_write((sector * FATFS_SECTOR_SIZE), (uint8_t *)buff, (count * FATFS_SECTOR_SIZE))) {
        sys_mutex_put(&fs_mutex);
        return RES_ERROR;
    }

    sys_mutex_put(&fs_mutex);
#else
    if (raw_flash_erase((sector * FATFS_SECTOR_SIZE + FATFS_FLASH_START_ADDR), (count * FATFS_SECTOR_SIZE)))
        return RES_ERROR;

    if (raw_flash_write((sector * FATFS_SECTOR_SIZE + FATFS_FLASH_START_ADDR), (uint8_t *)buff, (count * FATFS_SECTOR_SIZE)))
        return RES_ERROR;
#endif
#endif

    return RES_OK;
}

/*!
    \brief      read data from flash
    \param[in]  sector:	Start sector in LBA
    \param[out] buff: Data buffer to store read data
    \param[in]  count: Number of sectors to read
    \retval     result: 0 for success, -1 for fail
*/
int fs_flash_read(LBA_t sector, BYTE *buff, UINT count)
{
    if ((sector * FATFS_SECTOR_SIZE) > FATFS_FLASH_TOTAL_SIZE) {
        app_print("FATFS_ERROR: read out of range\r\n");
        return RES_ERROR;
    }

#ifdef USE_WL
    if (wl_flash_read(&wl_config_global, (sector * FATFS_SECTOR_SIZE), buff, (count * FATFS_SECTOR_SIZE)))
    {
        app_print("FATFS_ERROR: read from flash error!\r\n");
        return RES_ERROR;
    }
#else
#ifdef USE_QSPI_FLASH
    if (sys_mutex_try_get(&fs_mutex, 60000) != OS_OK) {
        app_print("FATFS_ERROR: read can't get mutex in one minute\r\n");
        return RES_ERROR;
    }

    if (qspi_flash_read((sector * FATFS_SECTOR_SIZE), (uint8_t *)buff, (count * FATFS_SECTOR_SIZE))) {
        app_print("FATFS_ERROR: read from flash error!\r\n");
        sys_mutex_put(&fs_mutex);
        return RES_ERROR;
    }

    sys_mutex_put(&fs_mutex);
#else
    if (raw_flash_read((sector * FATFS_SECTOR_SIZE + FATFS_FLASH_START_ADDR), buff, (count * FATFS_SECTOR_SIZE))) {
        app_print("FATFS_ERROR: read from flash error!\r\n");
        return RES_ERROR;
    }
#endif
#endif
    return RES_OK;
}

uint32_t fs_flash_size(void)
{
    return FATFS_FLASH_TOTAL_SIZE;
}

#endif /* CONFIG_FATFS_SUPPORT */
